main_menu = ['-------------------Главное меню-------------------',
             'Показать все заметки',
             'Показать заметки за определенную дату',
             'Показать конкретную заметку',
             'Добавить новую заметку',
             'Редактировать заметку',
             'Удалить заметку',
             'Завершение работы', ]

main_menu_choice = 'Выберете пункт меню: '

main_menu_input_error = f'Ошибка ввода. Введите число от 1 до {len(main_menu)-1}: '

main_menu_exit = '-----------------Завершение работы----------------'

title = 'Заголовок'

body = 'Заметка'

date = 'Дата'

filter_date = 'Введите дату в формате ГГГГ-ММ-ДД: '

date_error = 'Ошибка в введенной дате'

notes_date_not_found = 'По введенной дате нет заметок'

section_field = "-" * 50

notes_not_found = 'Заметок еще нет'

input_note_id = 'Введите ID заметки: '

input_title = 'Введите заголовок: '

input_body = 'Введите тело заметки: '

note_is_not_change = "Заметка не изменена"

add_new_note_successful = 'Новая заметка успешно добавлена'

edit_note_successful = 'Заметка успешно изменена'

id_note_not_found = 'Не найдено заметки с введенным ID'

input_new_title = 'Введите новый заголовок (было: '

input_new_body = 'Введите новое тело заметки (было: '

ask_delete_note = 'Вы уверены что хотите удалить? 1 = Да, 2 = Нет: '

note_delete_abort = 'Удаление отменено'

note_delete_successful = 'Заметка успешно удалена'

input_error = 'Ошибка ввода'
